-- MySQL dump 10.13  Distrib 9.3.0, for Win64 (x86_64)
--
-- Host: 8.137.127.7    Database: rainbow_database
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */
;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */
;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */
;
/*!50503 SET NAMES utf8mb4 */
;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */
;
/*!40103 SET TIME_ZONE='+00:00' */
;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */
;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */
;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */
;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */
;

--
-- Table structure for table `class`
--

DROP TABLE IF EXISTS `class`;
/*!40101 SET @saved_cs_client     = @@character_set_client */
;
/*!50503 SET character_set_client = utf8mb4 */
;
CREATE TABLE `class` (
    `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '课程ID',
    `user_id` bigint unsigned NOT NULL COMMENT '用户ID',
    `class_name` varchar(255) NOT NULL COMMENT '课程名',
    `location` varchar(255) NOT NULL COMMENT '地点',
    `day_of_week` tinyint unsigned NOT NULL COMMENT '周几(1-7)',
    `week_list` json NOT NULL COMMENT '周数(JSON数组)',
    `session_list` json NOT NULL COMMENT '节次(JSON数组)',
    `teacher` varchar(255) NOT NULL COMMENT '教师',
    `color` varchar(7) NOT NULL DEFAULT '#1890ff' COMMENT '颜色',
    `remark` text COMMENT '备注',
    `is_deleted` tinyint NOT NULL DEFAULT '0' COMMENT '0-正常 1-删除',
    `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
    `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
    `ext_attr1` varchar(255) DEFAULT NULL COMMENT '扩展字段1',
    `ext_attr2` varchar(255) DEFAULT NULL COMMENT '扩展字段2',
    `ext_attr3` varchar(255) DEFAULT NULL COMMENT '扩展字段3',
    PRIMARY KEY (`id`),
    KEY `idx_user_id` (`user_id`),
    KEY `idx_day_of_week` (`day_of_week`),
    KEY `idx_class_status` (`is_deleted`, `day_of_week`),
    CONSTRAINT `fk_class_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE,
    CONSTRAINT `chk_day_of_week` CHECK (
        (`day_of_week` between 1 and 7)
    )
) ENGINE = InnoDB AUTO_INCREMENT = 18 DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '课程表';
/*!40101 SET character_set_client = @saved_cs_client */
;

--
-- Dumping data for table `class`
--

/*!40000 ALTER TABLE `class` DISABLE KEYS */
;
INSERT INTO
    `class`
VALUES (
        1,
        1,
        '中国近现代史纲要',
        '成都校区 E405',
        1,
        '[1, 2, 3, 4, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[9, 10]',
        '王雪山',
        '#1F0000',
        '中国近现代史纲要/AB21400002/(9-9节)1-4周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0\n中国近现代史纲要/AB21400002/(10-10节)1-4周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        2,
        1,
        '形势与政策1',
        '成都校区 E405',
        1,
        '[6, 7]',
        '[9, 10]',
        '王雪山',
        '#2F0001',
        '形势与政策1/AB21400005/(9-9节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5\n形势与政策1/AB21400005/(10-10节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        3,
        1,
        '婴幼儿回应性照料',
        '成都校区 C107（音乐综合实训室）',
        2,
        '[1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[3, 4]',
        '周红',
        '#3F0002',
        '婴幼儿回应性照料/BB10403020/(3-3节)1-4周,6-17周/成都校区 C107（音乐综合实训室）/周红/(2025-2026-1)-BB10403020-13/34/2\n婴幼儿回应性照料/BB10403020/(4-4节)1-4周,6-17周/成都校区 C107（音乐综合实训室）/周红/(2025-2026-1)-BB10403020-13/34/2',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        4,
        1,
        '教育见习I',
        '成都校区 外出',
        3,
        '[8]',
        '[1, 2, 3, 4, 5, 6, 7, 8]',
        '唐金金',
        '#4F0004',
        '教育见习I/CB21500008/(1-1节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(2-2节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(3-3节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(4-4节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(5-5节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(6-6节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(7-7节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(8-8节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        5,
        1,
        '教育见习I',
        '成都校区 外出',
        4,
        '[8]',
        '[1, 2, 3, 4, 5, 6, 7, 8]',
        '唐金金',
        '#5F0004',
        '教育见习I/CB21500008/(1-1节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(2-2节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(3-3节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(4-4节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(5-5节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(6-6节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(7-7节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(8-8节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        6,
        1,
        '教育见习I',
        '成都校区 外出',
        5,
        '[8]',
        '[1, 2, 3, 4, 5, 6, 7, 8]',
        '唐金金',
        '#6F0004',
        '教育见习I/CB21500008/(1-1节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(2-2节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(3-3节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(4-4节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(5-5节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(6-6节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(7-7节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(8-8节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        7,
        1,
        '幼儿园课程设计与实施',
        '成都校区 B104',
        3,
        '[1, 2, 3, 6, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[3, 4]',
        '唐金金',
        '#7F0000',
        '幼儿园课程设计与实施/BB10403017/(3-3节)1-3周,6周,9-17周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2\n幼儿园课程设计与实施/BB10403017/(4-4节)1-3周,6周,9-17周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        8,
        1,
        '幼儿园教育活动设计与实施',
        '成都校区 D107',
        3,
        '[1, 2, 3, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[5, 6]',
        '徐冬梅',
        '#8F0000',
        '幼儿园教育活动设计与实施/BB10403003/(5-5节)1-3周,6-7周,9-17周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2\n幼儿园教育活动设计与实施/BB10403003/(6-6节)1-3周,6-7周,9-17周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        9,
        1,
        '形势与政策1',
        '成都校区 E405',
        3,
        '[6, 7]',
        '[9, 10]',
        '王雪山',
        '#9F0000',
        '形势与政策1/AB21400005/(9-9节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5\n形势与政策1/AB21400005/(10-10节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        10,
        1,
        '形势与政策1',
        '成都校区 E405',
        3,
        '[1, 2, 3, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[9, 10]',
        '王雪山',
        '#AF0000',
        '中国近现代史纲要/AB21400002/(9-9节)1-3周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0\n中国近现代史纲要/AB21400002/(10-10节)1-3周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        11,
        1,
        '奥尔夫音乐教学法Ⅰ',
        '成都校区 F506（舞台排练实训室）',
        4,
        '[1, 2, 3, 5, 6, 7]',
        '[5, 6, 7, 8]',
        '张莹',
        '#BF0000',
        '奥尔夫音乐教学法Ⅰ/BB30403018/(5-5节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(6-6节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(7-7节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(8-8节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        12,
        1,
        '教师职业道德与教育政策法规',
        '成都校区 B102',
        5,
        '[1, 2, 3, 5, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[5, 6]',
        '杨薛琳',
        '#CF0000',
        '教师职业道德与教育政策法规/BB10403016/(5-5节)1-3周,5-7周,9-17周/成都校区 B102/杨薛琳/(2025-2026-1)-BB10403016-06/34/2.0\n教师职业道德与教育政策法规/BB10403016/(6-6节)1-3周,5-7周,9-17周/成都校区 B102/杨薛琳/(2025-2026-1)-BB10403016-06/34/2.0',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        13,
        1,
        '幼儿中医推拿Ⅰ',
        '成都校区 C107（音乐综合实训室）',
        5,
        '[1, 2, 3, 5, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[7, 8]',
        '李姝涵',
        '#DF0000',
        '幼儿中医推拿Ⅰ/BB30403021/(7-7节)1-3周,5-7周,9-17周/成都校区 C107（音乐综合实训室）/李姝涵/(2025-2026-1)-BB30403021-13/34/2\n幼儿中医推拿Ⅰ/BB30403021/(8-8节)1-3周,5-7周,9-17周/成都校区 C107（音乐综合实训室）/李姝涵/(2025-2026-1)-BB30403021-13/34/2',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        14,
        1,
        '奥尔夫音乐教学法Ⅰ',
        '成都校区 F506（舞台排练实训室）',
        6,
        '[5]',
        '[5, 6, 7, 8]',
        '张莹',
        '#EF0000',
        '奥尔夫音乐教学法Ⅰ/BB30403018/(5-5节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(6-6节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(7-7节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(8-8节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        15,
        1,
        '幼儿园课程设计与实施',
        '成都校区 B104',
        7,
        '[3]',
        '[3, 4]',
        '唐金金',
        '#FF0000',
        '幼儿园课程设计与实施/BB10403017/(3-3节)3周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2\n幼儿园课程设计与实施/BB10403017/(4-4节)3周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        16,
        1,
        '幼儿园教育活动设计与实施',
        '成都校区 D107',
        7,
        '[3]',
        '[5, 6]',
        '徐冬梅',
        '#F00000',
        '幼儿园教育活动设计与实施/BB10403003/(5-5节)3周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2\n幼儿园教育活动设计与实施/BB10403003/(6-6节)3周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    ),
    (
        17,
        1,
        '中国近现代史纲要',
        '成都校区 E405',
        7,
        '[3]',
        '[9, 10]',
        '王雪山',
        '#F10000',
        '中国近现代史纲要/AB21400002/(9-9节)3周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0\n中国近现代史纲要/AB21400002/(10-10节)3周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0',
        0,
        '2025-10-24 23:12:28',
        '2025-10-24 23:12:28',
        NULL,
        NULL,
        NULL
    );
/*!40000 ALTER TABLE `class` ENABLE KEYS */
;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */
;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */
;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */
;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */
;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */
;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */
;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */
;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */
;

-- Dump completed on 2025-11-04 23:26:20