USE `rainbow_database`;

CREATE TABLE `schedule` (
    `id` BIGINT UNSIGNED AUTO_INCREMENT PRIMARY KEY COMMENT '课表ID',
    `user_id` BIGINT UNSIGNED NOT NULL COMMENT '用户ID',
    `schedule_name` varchar(255) NOT NULL COMMENT '课程名',
    `start_time` VARCHAR(20) NOT NULL COMMENT '开课时间',
    `week_count` INT NOT NULL COMMENT '本学期周数',
    `timetable` JSON NOT NULL COMMENT '作息表',
    `create_time` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
    `update_time` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
    `remark` text DEFAULT NULL COMMENT '备注',
    `is_deleted` TINYINT NOT NULL DEFAULT 0 COMMENT '0-正常 1-删除',
    `ext_attr1` VARCHAR(255) DEFAULT NULL COMMENT '扩展字段1',
    `ext_attr2` VARCHAR(255) DEFAULT NULL COMMENT '扩展字段2',
    `ext_attr3` VARCHAR(255) DEFAULT NULL COMMENT '扩展字段3',
    INDEX `idx_user_id` (`user_id`),
    INDEX `idx_create_time` (`create_time`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '课表主表';

CREATE TABLE `course` (
    `id` BIGINT UNSIGNED AUTO_INCREMENT PRIMARY KEY COMMENT '课程表ID',
    `schedule_id` BIGINT UNSIGNED NOT NULL COMMENT '课表ID',
    `course_name` varchar(255) NOT NULL COMMENT '课程名',
    `color` VARCHAR(7) NOT NULL COMMENT '课程颜色',
    -- `time_slots` JSON NOT NULL COMMENT '课程时间段',-- 不需要
    `create_time` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
    `update_time` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
    `remark` text DEFAULT NULL COMMENT '备注',
    `is_deleted` TINYINT NOT NULL DEFAULT 0 COMMENT '0-正常 1-删除',
    `ext_attr1` VARCHAR(255) DEFAULT NULL COMMENT '扩展字段1',
    `ext_attr2` VARCHAR(255) DEFAULT NULL COMMENT '扩展字段2',
    `ext_attr3` VARCHAR(255) DEFAULT NULL COMMENT '扩展字段3',
    INDEX `idx_schedule_id` (`schedule_id`),
    INDEX `idx_create_time` (`create_time`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '课程详情表';

CREATE TABLE `course_time` (
    `id` BIGINT UNSIGNED AUTO_INCREMENT PRIMARY KEY COMMENT '课程时间段 ID',
    `course_id` BIGINT UNSIGNED NOT NULL COMMENT '课程表 ID',
    `location` VARCHAR(100) NOT NULL COMMENT '课程地点',
    `teacher` VARCHAR(50) NOT NULL COMMENT '教师姓名',
    `week_list` JSON NOT NULL COMMENT '周次列表，如 [1,2,3]',
    `section_list` JSON NOT NULL COMMENT '节次列表，如 [1,2,3]',
    `day_of_week` TINYINT UNSIGNED NOT NULL COMMENT '周几，1-7',
    `remark` TEXT DEFAULT NULL COMMENT '备注',
    `create_time` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
    `update_time` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
    `is_deleted` TINYINT NOT NULL DEFAULT 0 COMMENT '0-正常 1-删除',
    INDEX `idx_course_id` (`course_id`),
    INDEX `idx_teacher` (`teacher`),
    INDEX `idx_location` (`location`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '课程时间段表';

INSERT INTO
    schedule (
        `id`,
        `user_id`,
        `schedule_name`,
        `start_time`,
        `week_count`,
        `timetable`,
        `remark`
    )
VALUES (
        1,
        1,
        '2025夏季',
        '2025-09-08',
        17,
        '["8:25-9:10", "9:15-10:00", "10:10-10:55", "11:00-11:45", "14:00-14:45", "14:50-15:35", "15:45-16:30", "16:35-17:20", "18:30-19:15", "19:20-20:05", "20:10-20:55", "21:00-21:45"]',
        '25专升本学前教育6班课表(20250905142900362)'
    )

INSERT INTO
    course (
        `id`, -- '课程表ID'
        `schedule_id`, -- '课表ID'
        `course_name`, -- '课程名'
        `color`, -- '课程颜色'
        `remark`, -- '备注'
    )
VALUES (
        1,
        1,
        '中国近现代史纲要',
        '#112233',
        ''
    ),
    (2, 1, '形势与政策1', '#223344', ''),
    (
        3,
        1,
        '婴幼儿回应性照料',
        '#3F0002',
        '',
    ),
    (4, 1, '教育见习I', '#4F0004', '',),
    (
        5,
        1,
        '幼儿园课程设计与实施',
        '#7F0000',
        '',
    ),
    (
        6,
        1,
        '幼儿园教育活动设计与实施',
        '#8F0000',
        '',
    ),
    (
        7,
        1,
        '奥尔夫音乐教学法Ⅰ',
        '#BF0000',
        ''
    ),
    (
        8,
        1,
        '教师职业道德与教育政策法规',
        '#CF0000',
        ''
    ),
    (
        9,
        1,
        '幼儿中医推拿Ⅰ',
        '#DF0000',
        '',
    ),
INSERT INTO
    course_time (
        `id`, -- '课程时间段 ID'
        `course_id`, -- '课程表 ID'
        `location`, -- '课程地点'
        `teacher`, -- '教师姓名'
        `week_list`, -- '周次列表，如 [1,2,3]'
        `section_list`, -- '节次列表，如 [1,2,3]'
        `day_of_week`, -- '周几，1-7'
        `remark`, -- '备注'
    )
VALUES (
        1,
        1,
        '成都校区 E405',
        '王雪山',
        '[1, 2, 3, 4, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[9, 10]',
        1,
        '中国近现代史纲要/AB21400002/(9-9节)1-4周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0\n中国近现代史纲要/AB21400002/(10-10节)1-4周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0',
    ),
    (
        2,
        1,
        '成都校区 E405',
        '王雪山',
        '[3]',
        '[9, 10]',
        7,
        '中国近现代史纲要/AB21400002/(9-9节)3周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0\n中国近现代史纲要/AB21400002/(10-10节)3周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0',
    ),
    (
        3,
        2,
        '成都校区 E405',
        '王雪山',
        '[6, 7]',
        '[9, 10]',
        1,
        '形势与政策1/AB21400005/(9-9节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5\n形势与政策1/AB21400005/(10-10节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5',
    ),
    (
        4,
        2,
        '成都校区 E405',
        '王雪山',
        '[6, 7]',
        '[9, 10]',
        3,
        '形势与政策1/AB21400005/(9-9节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5\n形势与政策1/AB21400005/(10-10节)6-7周/成都校区 E405/王雪山/(2025-2026-1)-AB21400005-08/8/0.5',
    ),
    (
        5,
        2,
        '成都校区 E405',
        '王雪山',
        '[1, 2, 3, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[9, 10]',
        3,
        '中国近现代史纲要/AB21400002/(9-9节)1-3周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0\n中国近现代史纲要/AB21400002/(10-10节)1-3周,9-16周/成都校区 E405/王雪山/(2025-2026-1)-AB21400002-10/48/3.0',
    ),
    (
        6,
        3,
        '成都校区 C107（音乐综合实训室）',
        '周红',
        '[1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[3, 4]',
        2,
        '婴幼儿回应性照料/BB10403020/(3-3节)1-4周,6-17周/成都校区 C107（音乐综合实训室）/周红/(2025-2026-1)-BB10403020-13/34/2\n婴幼儿回应性照料/BB10403020/(4-4节)1-4周,6-17周/成都校区 C107（音乐综合实训室）/周红/(2025-2026-1)-BB10403020-13/34/2',
    ),
    (
        7,
        4,
        '成都校区 外出',
        '唐金金',
        '[8]',
        '[1, 2, 3, 4, 5, 6, 7, 8]',
        3,
        '教育见习I/CB21500008/(1-1节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(2-2节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(3-3节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(4-4节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(5-5节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(6-6节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(7-7节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(8-8节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1',
    ),
    (
        8,
        4,
        '成都校区 外出',
        '唐金金',
        '[8]',
        '[1, 2, 3, 4, 5, 6, 7, 8]',
        4,
        '教育见习I/CB21500008/(1-1节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(2-2节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(3-3节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(4-4节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(5-5节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(6-6节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(7-7节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(8-8节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1',
    ),
    (
        9,
        4,
        '成都校区 外出',
        '唐金金',
        '[8]',
        '[1, 2, 3, 4, 5, 6, 7, 8]',
        5,
        '教育见习I/CB21500008/(1-1节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(2-2节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(3-3节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(4-4节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(5-5节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(6-6节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(7-7节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1\n教育见习I/CB21500008/(8-8节)8周/成都校区 外出/唐金金/(2025-2026-1)-CB21500008-06/17/1',
    ),
    (
        10,
        5,
        '成都校区 B104',
        '唐金金',
        '[1, 2, 3, 6, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[3, 4]',
        3,
        '幼儿园课程设计与实施/BB10403017/(3-3节)1-3周,6周,9-17周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2\n幼儿园课程设计与实施/BB10403017/(4-4节)1-3周,6周,9-17周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2',
    ),
    (
        11,
        5,
        '成都校区 B104',
        '唐金金',
        '[3]',
        '[3, 4]',
        7,
        '幼儿园课程设计与实施/BB10403017/(3-3节)3周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2\n幼儿园课程设计与实施/BB10403017/(4-4节)3周/成都校区 B104/唐金金/(2025-2026-1)-BB10403017-06/34/2',
    ),
    (
        12,
        6,
        '成都校区 D107',
        '徐冬梅',
        '[1, 2, 3, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[5, 6]',
        3,
        '幼儿园教育活动设计与实施/BB10403003/(5-5节)1-3周,6-7周,9-17周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2\n幼儿园教育活动设计与实施/BB10403003/(6-6节)1-3周,6-7周,9-17周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2',
    ),
    (
        13,
        6,
        '成都校区 D107',
        '徐冬梅',
        '[3]',
        '[5, 6]',
        7,
        '幼儿园教育活动设计与实施/BB10403003/(5-5节)3周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2\n幼儿园教育活动设计与实施/BB10403003/(6-6节)3周/成都校区 D107/徐冬梅/(2025-2026-1)-BB10403003-16/34/2',
    ),
    (
        14,
        7,
        '成都校区 F506（舞台排练实训室）',
        '张莹',
        '[1, 2, 3, 5, 6, 7]',
        '[5, 6, 7, 8]',
        4,
        '奥尔夫音乐教学法Ⅰ/BB30403018/(5-5节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(6-6节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(7-7节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(8-8节)1-3周,5-7周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0',
    ),
    (
        15,
        7,
        '成都校区 F506（舞台排练实训室）',
        '张莹',
        '[5]',
        '[5, 6, 7, 8]',
        6,
        '奥尔夫音乐教学法Ⅰ/BB30403018/(5-5节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(6-6节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(7-7节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0\n奥尔夫音乐教学法Ⅰ/BB30403018/(8-8节)5周/成都校区 F506（舞台排练实训室）/张莹/(2025-2026-1)-BB30403018-14/34/2.0',
    ),
    (
        16,
        8,
        '成都校区 B102',
        '杨薛琳',
        '[1, 2, 3, 5, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[5, 6]',
        5,
        '教师职业道德与教育政策法规/BB10403016/(5-5节)1-3周,5-7周,9-17周/成都校区 B102/杨薛琳/(2025-2026-1)-BB10403016-06/34/2.0\n教师职业道德与教育政策法规/BB10403016/(6-6节)1-3周,5-7周,9-17周/成都校区 B102/杨薛琳/(2025-2026-1)-BB10403016-06/34/2.0',
        0,
    ),
    (
        17,
        9,
        '成都校区 C107（音乐综合实训室）',
        '李姝涵',
        '[1, 2, 3, 5, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16]',
        '[7, 8]',
        5,
        '幼儿中医推拿Ⅰ/BB30403021/(7-7节)1-3周,5-7周,9-17周/成都校区 C107（音乐综合实训室）/李姝涵/(2025-2026-1)-BB30403021-13/34/2\n幼儿中医推拿Ⅰ/BB30403021/(8-8节)1-3周,5-7周,9-17周/成都校区 C107（音乐综合实训室）/李姝涵/(2025-2026-1)-BB30403021-13/34/2',
    ),